Nb = 50; % ξονες βςιηαδω
%1c
Fs = 5000 + 100*Nb; % ώαστοτα δισλςετιϊαγιι (ηΓ)
ft = Fs/10 + 20*Nb;% ηςαξιώξαρ ώαστοτα ππ (ηΓ)
fk = Fs/10 + 250 + 25*Nb; % ηςαξιώξαρ ώαστοτα πϊ (ηΓ)
d1 = 0.05; % ναλσιναμψξο δοπυστινοε οτλμοξεξιε χ ππ
d2 = 0.01; % ναλσιναμψξο δοπυστινοε οτλμοξεξιε χ πϊ
Ap = 0.4455; % ναλσιναμψξο δοπυστινοε ϊατυθαξιε χ ππ
Ast = 40; % νιξιναμψξο δοπυστινοε ϊατυθαξιε χ πϊ
b1 = func_1c(Fs, ft, fk, d1, d2);
pause
% 2c-3c
f1 = 312.5;
f2 = 2500;
A1 = 10;
A2 = 4;
[input, reaction] = func_2c(b1, Fs, A1, A2, f1, f2); % N*f1, N*f2 ΔΟΜΦΞΩ ΞΑΓΕΜΟ ΔΕΜΙΤΨΣΡ ΞΑ FS ήΤΟΒΩ ΣΠΕΛΤÒ ΞΕ ÒΑΣΤΕΛΑΜΣΡ (N=64)

% 4c
% MAG_lowpass = fdesign.lowpass('Fp,Fst,Ap,Ast',ft,fk,Ap,Ast,Fs);
% F_lowpass = equiripple(MAG_lowpass);
% fvtool(F_lowpass)