clc
clear
Nb = 4; % ξονες βςιηαδω (ΧΩΒÒΑΤΨ ΠΟ ΧΑÒΙΑΞΤΥ)
N = 64; % δμιξα (πεςιοδ) ποσμεδοχατεμψξοστι 1
M = 71; % δμιξα (πεςιοδ) ποσμεδοχατεμψξοστι 2
Fs = 2000*mod(Nb, 5) + 1; % ώαστοτα δισλςετιϊαγιι (ηΓ)
A1 = 1 + 0.01*Nb; % ανπμιτυδω δισλςετξωθ ηαςνοξιλ
A2 = 2*A1;
f1 = Fs/4; % ώαστοτω δισλςετξωθ ηαςνοξιλ (ηΓ)
f2 = 1.5*f1;

disp('%')
disp('% Π.1. πςοχεςλα ςαχεξστχα παςσεχαμρ')
n = 0:(N-1); % δισλςετξοε ξοςνιςοχαξξοε χςενρ
k = 0:(N-1); % δισλςετξαρ ξοςνιςοχαξξαρ ώαστοτα
w1 = 2*pi*f1/Fs; w2 = 2*pi*f2/Fs; % ξοςνιςοχαξξωε ώαστοτω δισλςετξωθ ηαςνοξιλ(ςαδ)
x = A1*cos(w1*n)+A2*cos(w2*n); % ποσμεδοχατεμψξοστψ(πεςιοδ N)
X = fft(x); % δπζ ποσμεδοχατεμψξοστι
E1 = sum(x.^2); % όξεςηιρ ποσμεδοχατεμψξοστι, χωώισμεξξαρ πο εε οτσώεταν
E2 = (1/N)*sum(abs(X).^2); % όξεςηιρ ποσμεδοχατεμψξοστι, χωώισμεξξαρ πο οτσώεταν δπζ
disp('%')
disp('% δΜΡ ΧΩΧΟΔΑ ΜΕΧΟΚ (E1) Ι ΠÒΑΧΟΚ (E2) ήΑΣΤΕΚ ςαχεξστχα παςσεχαμρ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')
disp([' E1 = ',num2str(E1),' E2 = ' num2str(E2)])
disp('%')
disp('% δΜΡ ΠÒΟΔΟΜΦΕΞΙΡ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')

n = 0:(M-1); % δισλςετξοε ξοςνιςοχαξξοε χςενρ
k = 0:(M-1); % δισλςετξαρ ξοςνιςοχαξξαρ ώαστοτα
x = A1*cos(w1*n)+A2*cos(w2*n); % ποσμεδοχατεμψξοστψ(πεςιοδ N)
X = fft(x); % δπζ ποσμεδοχατεμψξοστι
E1 = sum(x.^2); % όξεςηιρ ποσμεδοχατεμψξοστι, χωώισμεξξαρ πο εε οτσώεταν
E2 = (1/M)*sum(abs(X).^2); % όξεςηιρ ποσμεδοχατεμψξοστι, χωώισμεξξαρ πο οτσώεταν δπζ
disp('%')
disp('% δΜΡ ΧΩΧΟΔΑ ΜΕΧΟΚ (E1) Ι ΠÒΑΧΟΚ (E2) ήΑΣΤΕΚ ςαχεξστχα παςσεχαμρ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')
disp([' E1 = ',num2str(E1),' E2 = ' num2str(E2)])
disp('%')
disp('% δΜΡ ΠÒΟΔΟΜΦΕΞΙΡ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')
disp('% ςαβοτα ϊαχεςϋεξα')