clc
clear
disp('% Π.2. ισσμεδοχαξιε όζζελτα ςαστελαξιρ σπελτςα δμρ οδξοκ δισλςετξοκ ηαςνοξιλι')
Nb = 4; % ξονες βςιηαδω (ΧΩΒÒΑΤΨ ΠΟ ΧΑÒΙΑΞΤΥ)
N = 78; % δμιξα (πεςιοδ) ποσμεδοχατεμψξοστι (choose randomly)
Fs = 2000*mod(Nb, 5) + 1; % ώαστοτα δισλςετιϊαγιι (ηΓ)
A1 = 1 + 0.01*Nb; % ανπμιτυδω δισλςετξωθ ηαςνοξιλ
A2 = 2*A1;
f1 = Fs/5; % ώαστοτω δισλςετξωθ ηαςνοξιλ (ηΓ)(choose randomly)
f2 = 1.5*f1;

n = 0:(N-1); % δισλςετξοε ξοςνιςοχαξξοε χςενρ (πεςιοδ N)
k = 0:(N-1); % δισλςετξαρ ξοςνιςοχαξξαρ ώαστοτα (πεςιοδ N)
w1 = 2*pi*f1/Fs; % ξοςνιςοχαξξαρ ώαστοτα (ςαδ)
x_N = A1*cos(w1*n); % ποσμεδοχατεμψξοστψ (πεςιοδ N)
X_N = fft(x_N); % δπζ ποσμεδοχατεμψξοστι (πεςιοδ N)
MOD_N = (2/N)*abs(X_N); % ανπμιτυδξωκ σπελτς ποσμεδοχατεμψξοστι (πεςιοδ N)
MOD_N(1) = (1/N)*abs(X_N(1));

win_N = hamming(N)'; % ολξο θόννιξηα ? χελτος-στομβεγ δμιξω M
xw_N = x_N.*win_N; % ποσμεδοχατεμψξοστψ, χϊχεϋεξξαρ ολξον
XW_N = fft(xw_N); % δπζ χϊχεϋεξξοκ ποσμεδοχατεμψξοστι
MODW_N =(2/N)*abs(XW_N); % ανπμιτυδξωκ σπελτς χϊχεϋεξξοκ ποσμεδοχατεμψξοστι
MODW_N(1) =(1/N)*abs(XW_N(1));

P_N = N*f1/Fs; % ώισμο πεςιοδοχ δισλςετξοκ ηαςνοξιλι σ ώαστοτοκ f1 ξα πεςιοδε ποσμεδοχατεμψξοστι N
disp('%')
disp('% δΜΡ ΧΩΧΟΔΑ ώισμα πεςιοδοχ ΔΙΣΛÒΕΤΞΟΚ ΗΑÒΝΟΞΙΛΙ σ ώαστοτοκ f1 ΞΑΦΝΙΤΕv<ENTER>')
pause
disp('%')
disp(['N = ',num2str(N),' --> P_N = ' num2str(P_N)])
disp('εΣΜΙ ήΙΣΜΟ P_N ΞΕ ΓΕΜΟΕ, ΤΟ ΒΥΔΕΤ ΞΑΒΜΐΔΑΤΨΣΡ ΡΧΜΕΞΙΕ ÒΑΣΤΕΛΑΞΙΡ ΣΠΕΛΤÒΑ - ΔΜΡ ΥΣΤÒΑΞΕΞΙΡ άΤΟΗΟ άΖΖΕΛΤΑ ΠÒΙΝΕΞΙΝ ΟΛΞΟ θάΝΝΙΞΗΑ')
disp('%')
disp('% δΜΡ ΧΩΧΟΔΑ ηςαζιλοχ ανπμιτυδξωθ σπελτςοχ ΞΑΦΝΙΤΕ <ENTER>')
pause
figure('Name','Amplitude Spectrum','NumberTitle', 'off')
subplot(2,1,1), stem(k,MOD_N,'MarkerSize',3), grid, xlabel('k')
title(strcat(['Amplitude Spectrum of the Periodic Sequence N = ',num2str(N)]))
subplot(2,1,2), stem(k,MODW_N,'MarkerSize',3), grid, xlabel('k')
title(strcat(['Amplitude spectrum with Hamming Window N = ',num2str(N)]))
disp('%')
disp('% δΜΡ ΠÒΟΔΟΜΦΕΞΙΡ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')
disp('% ςαβοτα ϊαχεςϋεξα')