clc
clear
Nb = 4; % ξονες βςιηαδω (ΧΩΒÒΑΤΨ ΠΟ ΧΑÒΙΑΞΤΥ)
N = 64; % δμιξα (πεςιοδ) ποσμεδοχατεμψξοστι 1
M = 71; % δμιξα (πεςιοδ) ποσμεδοχατεμψξοστι 2
Fs = 2000*mod(Nb, 5) + 1; % ώαστοτα δισλςετιϊαγιι (ηΓ)
A1 = 1 + 0.01*Nb; % ανπμιτυδω δισλςετξωθ ηαςνοξιλ
A2 = 2*A1;
f1 = Fs/4; % ώαστοτω δισλςετξωθ ηαςνοξιλ (ηΓ)
f2 = 1.5*f1;

disp('% Π.5. υμυώϋεξιε ςαϊμιώεξιρ δισλςετξωθ ηαςνοξιλ σ βμιϊλο ςασπομοφεξξωνι ώαστοτανι')
f1_2 = 1.1*f1; % ώαστοτω δισλςετξωθ ηαςνοξιλ (ηΓ)
f2_2 = 1.15*f1;
N = 2*N;
disp('%')
disp('% δΜΡ ΧΩΧΟΔΑ πεςιοδα ποσμεδοχατεμψξοστι Ι')
disp('% ώαστοτ ηαςνοξιλ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')
disp([' N = ',num2str(N)])
disp([' f1_2 = ',num2str(f1_2),' f2_2 = ' num2str(f2_2)])
Delta_N = Fs/N; % ςαϊςεϋεξιε πο ώαστοτε
Delta_f = abs(f1_2-f2_2); % ςασστορξιε νεφδυ ώαστοτανι
L = ceil(Fs/(Delta_f-Delta_N)); % χωβςαξξαρ δμιξα L
Delta_L = Fs/L; % πεςιοδ δισλςετιϊαγιι πο ώαστοτε πςι δμιξε L

n = 0:(N-1); % δισλςετξοε ξοςνιςοχαξξοε χςενρ
w1_2 = 2*pi*f1_2/Fs; w2_2 = 2*pi*f2_2/Fs; % ξοςνιςοχαξξωε ώαστοτω
x2 = A1*cos(w1_2*n)+A2*cos(w2_2*n); % λοξεώξαρ ποσμεδοχατεμψξοστψ
X2 = fft(x2); % δπζ λοξεώξοκ ποσμεδοχατεμψξοστι δμιξω N
MOD2 = abs(X2); % νοδυμψ δπζ
X2_L = fft(x2,L); % δπζ λοξεώξοκ ποσμεδοχατεμψξοστι, δοπομξεξξοκ ξυμρνι δο δμιξω L
MOD2_L = abs(X2_L); % νοδυμψ δπζ
disp('% δΜΡ ΧΩΧΟΔΑ ηςαζιλοχ N-τοώεώξοηο δπζ Ι νοδυμρ σπελτςαμψξοκ')
disp('% πμοτξοστι, χοσσταξοχμεξξοκ πο L τοώλαν, ΞΑΦΝΙΤΕ <ENTER>')
pause
k = 0:(N-1); % δισλςετξαρ ξοςνιςοχαξξαρ ώαστοτα πςι δμιξε N
k1 = 0:(L-1); % δισλςετξαρ ξοςνιςοχαξξαρ ώαστοτα πςι δμιξε L
figure('Name','Discrete Harmonic Signal with Close Frequencies','NumberTitle', 'off')
subplot(2,1,1), stem(k,MOD2), grid, xlabel('k')
title(strcat(['DFT Modulus N = ',num2str(N)]))
subplot(2,1,2), plot(k1,MOD2_L,'r','MarkerSize',3, 'Linewidth',2)
grid, hold on, stem(k1,MOD2_L,':'), xlabel('k')
title(strcat(['Spectral Density Modulus L = ',num2str(L)]))
L_2 = ceil(L/2); % οσξοχξαρ πομοσα ώαστοτ L/2
[MODm, m]= max(MOD2_L(1:(L_2))); % ναλσινυν MODm ι ιξδελσ m χελτοςα MOD2_L (πεςχωκ πιλ)
k_1 = (m-1); f_1 = k_1*Delta_L; % δισλςετξαρ ξοςνιςοχαξξαρ ι αβσομΰτξαρ(ηΓ) ώαστοτω πεςχοηο πιλα
K = ceil(L/N); % λομιώεστχο οτσώετοχ ξα πεςιοδε δισλςετιϊαγιι Fs/N
K1 = m+K; K2 = m+2*K-1; % ξιφξρρ K1 Ι χεςθξρρ K2 ηςαξιγω ιξτεςχαμα πςι ποισλε χτοςοηο πιλα σπςαχα
[MODm1, m1]= max(MOD2_L(K1:K2)); % ναλσινυν MODm1 ι ιξδελσ m1 νοδυμρ δπζ MOD2_L ξα ιξτεςχαμε [K1 K2]
K3 = m-(2*K-1); K4 = m-K; % ξιφξρρ K3 Ι χεςθξρρ K4 ηςαξιγω ιξτεςχαμα πςι ποισλε χτοςοηο πιλα σμεχα
[MODm2, m2]= max(MOD2_L(K3:K4)); % ναλσινυν MODm2 ι ιξδελσ m2 νοδυμρ δπζ MOD2_L ξα ιξτεςχαμε [K3 K4]
if (MODm1>MODm2)
    k_2 = (K1+m1-1)-1; f_2 = k_2*Delta_L; % δισλςετξαρ ξοςνιςοχαξξαρ ι αβσομΰτξαρ (ηΓ) ώαστοτω χτοςοηο πιλα, εσμι οξ σπςαχα οτ πεςχοηο
else
    k_2 = (K3+m2-1)-1; f_2 = k_2*Delta_L; % δισλςετξαρ ξοςνιςοχαξξαρ ι αβσομΰτξαρ (ηΓ) ώαστοτω χτοςοηο πιλα, εσμι οξ σμεχα οτ πεςχοηο
end
disp('%')
disp('% οΠÒΕΔΕΜΙΤΕ ώαστοτω ηαςνοξιλ ΠΟ ηςαζιλυ')
disp('%')
disp('% δΜΡ ΧΩΧΟΔΑ ώαστοτ ηαςνοξιλ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')
disp([' k_1 = ',num2str(k_1),' f_1 = ' num2str(f_1)])
disp([' k_2 = ',num2str(k_2),' f_2 = ' num2str(f_2)])
disp('%')
disp('% δΜΡ ΠÒΟΔΟΜΦΕΞΙΡ ΞΑΦΝΙΤΕ <ENTER>')
pause
disp('%')
disp('% ςαβοτα ϊαχεςϋεξα')